Revit 2024 API
Transaction Constructor
Overload List
Name | Description
Transaction(Document)
 Instantiates a transaction object.
Transaction(Document, String)
 Instantiates a transaction object
See Also
Transaction Class
Transaction Members
Autodesk.Revit.DB Namespace